In [1]:
import pandas as pd

# Assignment 1: Date Formats and Date Parts

* First, convert the `date` column to datetime64, by any method.

* Then, create a column representing the time difference between the last date in the data and each date. 

* Next, create columns for the date parts year, month, and weekday.

* Finally, format the date to Year-Month-Day (This will be a string/object).

In [6]:
# read in transactions.csv 
transactions = pd.read_csv('../retail/transactions.csv')

In [11]:
transactions = transactions.astype({
    'date':'datetime64[ns]'
})

In [14]:
transactions = transactions.assign(
    year = transactions['date'].dt.year,
    month = transactions['date'].dt.month,
    day_of_week = transactions['date'].dt.day_of_week
)

In [19]:
transactions = transactions.assign(
    time_to_last_date = transactions['date'].max() - transactions['date']
)

In [20]:
transactions

,date,store_nbr,transactions,year,month,day_of_week,time_to_last_date
0,2013-01-01,25,770,2013,1,1,1687 days
1,2013-01-02,1,2111,2013,1,2,1686 days
2,2013-01-02,2,2358,2013,1,2,1686 days
3,2013-01-02,3,3487,2013,1,2,1686 days
4,2013-01-02,4,1922,2013,1,2,1686 days
...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,2017,8,1,0 days
83484,2017-08-15,51,1573,2017,8,1,0 days
83485,2017-08-15,52,2255,2017,8,1,0 days
83486,2017-08-15,53,932,2017,8,1,0 days
83487,2017-08-15,54,802,2017,8,1,0 days

# Assignment 2: Time Arithmetic


Hi again,

I just got word the the true max date in our data was three weeks after 2017-08-15.

* Can you add three weeks to the ‘time_to_last_date’ column? 
* Then, calculate ‘weeks_to_last_date’ by dividing the number of days  in ‘time_to_last_date’ by 7.

Thanks

In [21]:
# overwrite previous transactions df and convert date column

transactions = pd.read_csv("../retail/transactions.csv", parse_dates=["date"])

In [22]:
transactions.tail()

            date  store_nbr  transactions
83483 2017-08-15         50          2804
83484 2017-08-15         51          1573
83485 2017-08-15         52          2255
83486 2017-08-15         53           932
83487 2017-08-15         54           802

In [23]:
# recreate columns from assignment 1 using assign

transactions = transactions.assign(
    year=transactions["date"].dt.year,
    month=transactions["date"].dt.month,
    day_of_week=transactions["date"].dt.dayofweek,
    time_to_last_date=transactions["date"].max() - transactions["date"],
)

transactions.head()

,date,store_nbr,transactions,year,month,day_of_week,time_to_last_date
0,2013-01-01,25,770,2013,1,1,1687 days
1,2013-01-02,1,2111,2013,1,2,1686 days
2,2013-01-02,2,2358,2013,1,2,1686 days
3,2013-01-02,3,3487,2013,1,2,1686 days
4,2013-01-02,4,1922,2013,1,2,1686 days

In [33]:
transactions['time_to_last_date'] = transactions['time_to_last_date'] + pd.to_timedelta(3,unit='W')
transactions['weeks_to_last_date'] = (transactions['time_to_last_date'] / pd.to_timedelta(7,unit='D')).astype('int')

transactions

,date,store_nbr,transactions,year,month,day_of_week,time_to_last_date,weeks_to_last_date
0,2013-01-01,25,770,2013,1,1,1855 days,265
1,2013-01-02,1,2111,2013,1,2,1854 days,264
2,2013-01-02,2,2358,2013,1,2,1854 days,264
3,2013-01-02,3,3487,2013,1,2,1854 days,264
4,2013-01-02,4,1922,2013,1,2,1854 days,264
...,...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,2017,8,1,168 days,24
83484,2017-08-15,51,1573,2017,8,1,168 days,24
83485,2017-08-15,52,2255,2017,8,1,168 days,24
83486,2017-08-15,53,932,2017,8,1,168 days,24
83487,2017-08-15,54,802,2017,8,1,168 days,24

# Assignment 3: Missing Time Series Data

Take a look at the mean value for the oil price using forward fill, backfill, and interpolation. Are they very different?

Then, plot the series with forward fill for:
 * The year 2014.
 * The month of December 2014.
 * The days from December 1st to December 15th, 2014.

In [ ]:
# Read in oil csv with date as index (and converted to datetime64)
oil = pd.read_csv("../retail/oil.csv", 
                  index_col="date", 
                  parse_dates=True)

In [ ]:
# This is a synonym for datetime64

oil.index.dtype

In [ ]:
# mean of original series

oil.mean()

In [ ]:
# original plot

oil.plot()

# Assignment 4: Shift and Diff

Hello,
I’m looking into a few different year over year trends related to changes made at store 47.

Can you plot the sum of monthly of transactions in year 2015 vs the sum of monthly transactions in the year prior for store 47?

Make sure to group your DataFrame by year AND month!

Thanks

# Assignment 5: Resampling Time Series

Plot the monthly and yearly average oil prices.

In [ ]:
oil.head()

# Assignment 6: Rolling Averages

Plot the 90-day moving average for transactions for store 47.

This will help remove some of the noise from our series.

Thanks!

In [ ]:
# recreate transactions_47 with date as index 

transactions_47 = (transactions
                   .loc[transactions["store_nbr"]==47, ["date", "transactions"]]
                   .set_index("date"))

transactions_47.head()

In [ ]:
# original daily series for comparison

transactions_47.plot()